<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>PayloadContent</key>
  <array>
    <dict>
      <key>PayloadType</key>
      <string>com.microsoft.Edge</string>
      <key>PayloadVersion</key>
      <integer>1</integer>
      <key>PayloadIdentifier</key>
      <string>com.company.edge.popup.policy</string>
      <key>PayloadDisplayName</key>
      <string>Edge Popup Policy</string>
      <key>PopupsAllowedForUrls</key>
      <array>
        <string>https://*.company.com</string>
        <string>https://portal.office.com</string>
        <string>https://*.sharepoint.com</string>
      </array>
      <key>PopupsBlockedForUrls</key>
      <array>
        <string>https://*.ads.microsoft.com</string>
        <string>https://*.doubleclick.net</string>
      </array>
      <key>DefaultPopupsSetting</key>
      <integer>2</integer>
    </dict>
  </array>
  <key>PayloadDescription</key>
  <string>Edge popup management policy</string>
  <key>PayloadDisplayName</key>
  <string>Edge Popup Policy</string>
  <key>PayloadIdentifier</key>
  <string>com.company.edge.popup.policy</string>
  <key>PayloadType</key>
  <string>Configuration</string>
  <key>PayloadUUID</key>
  <string>87654321-4321-4321-4321-210987654321</string>
  <key>PayloadVersion</key>
  <integer>1</integer>
</dict>
</plist>
